export const MESSAGES = {
    allChannels: "Управление каналами:",
    addChannel:
        "Добавьте бота @egomia\\_gift\\_bot в ваш канал или чат как *администратора* с *правом* публикации сообщений. После этого отправьте мне канал в *формате* @channel\\_name.",
    addChannelFormatError: "*Неверный формат*, попробуйте еще раз",
    addChannelBotRightsError: "Бот не является *администратором* канала.",
    addChannelUserRightsError: "Вы не являетесь *администратором* канала.",
    allGifts: "Управление конкурсами:",
    addGiftChannelsCountError: "У вас *нет* добавленных каналов.",
    addGiftStartPost:
        "Отправьте текст для розыгрыша. Вы можете также отправить вместе с текстом картинку, видео или GIF. \n \n *Вы можете использовать только 1 медиафайл.*",
    addGiftEndPost:
        "Отправьте текст для результата. Вы можете также отправить вместе с текстом картинку, видео или GIF. \n \n *Вы можете использовать только 1 медиафайл.*",
    addGiftEmptyTextError:
        "Текст поста не должен быть *пустой*, попробуйте еще раз.",
    addGiftCountPhotoError:
        "Вы можете использовать *только 1 медиафайл*, попробуйте еще раз.",
    addGiftStartPostDate:
        "Отправьте дату и время публикации в формате *дд.мм.гггг чч:мм* по *московскому* времени",
    addGiftStartPostDateFormatError:
        "Неверный формат даты и времени, попробуйте еще раз.",
    addGiftChannels: "Выберите каналы для публикации:",
    addGiftFinal: "Конкурс создан и готов к публикации.",
    addGiftEndPostFinal: "Результат создан и готов к публикации.",
};
